Tekla Open API Reference for Tekla Structures 2025
BaseRebarGroup.RebarGroupSpacingTypeEnum Enumeration
 The ways to distribute the reinforcing bars with different spacings.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum RebarGroupSpacingTypeEnum
Public Enumeration RebarGroupSpacingTypeEnum
Members
Member name | Value | Description
SPACING_TYPE_UNDEFINED | 0 |  The undefined spacing type.
SPACING_TYPE_EXACT_SPACINGS | 1 |  The bars are distributed using the spacing values.
SPACING_TYPE_EXACT_NUMBER | 2 |  Equal distribution by the number of reinforcing bars.
SPACING_TYPE_TARGET_SPACE | 3 |  Equal distribution by the target spacing value.
SPACING_TYPE_EXACT_SPACE_FLEX_AT_START | 4 |  Distribution by the exact spacing value with a flexible first space.
SPACING_TYPE_EXACT_SPACE_FLEX_AT_END | 5 |  Distribution by the exact spacing value with a flexible last space.
SPACING_TYPE_EXACT_SPACE_FLEX_AT_BOTH | 6 |  Distribution by the exact spacing value with flexible first and last spaces.
SPACING_TYPE_EXACT_SPACE_FLEX_AT_MIDDLE | 7 |  Distribution by the exact spacing value with a flexible middle space.
See Also
Reference
Tekla.Structures.Model Namespace